:PROPERTIES:
:ID: 0c9bef25-85ef-48e8-b4fd-d60160f177ec
:END:
#+TITLE: play.teod.eu

[[file:..][..]]

| Canonical URL           | https://play.teod.eu/                                  |
| Source                  | https://github.com/teodorlu/play.teod.eu               |
| How was it made? talk 1 | [[id:26776cc4-e64d-494b-b24c-784b2c57866d][Build Your Own Little Memex with Babashka]]              |
| How was it made? talk 2 | [[id:B1860066-312A-438D-975E-6393B140121F][Clojure visual-tools meeting 15 - play.teod.eu, Kindly]] |

Yeah, the page on play.teod.eu on play.teod.eu.
Kind of weird, right?

Whether this is "a remote reference" or not is up for discussion.

:)

I'm using remote references /as direct commentary/ on for example [[id:dde82bbc-e4c8-49c0-b577-dba0cba0bdf7][The Beginning of Infinity]], and I really like that.
Rich references.
Mmmmm.

What follows is discussion / a retrospective for this page.

1. first, a critique synthesis
2. then, a critique sandbox & options
3. then, a journal

Language: mostly English, some Norwegian.

"As someone who is not Teodor, should I read this?"
This is mostly a project page for myself.
So it's definitely not required reading.
But it's public, and open for comments!

** elisp text
#+begin_src emacs-lisp
(message "hello, there")
#+end_src

#+RESULTS:
: hello, there

#+BEGIN_SRC emacs-lisp
(progn)
(setq some-name "Dustyn")
(setq some-age 10)
(1,2, some-name, some-age)
#+END_SRC
** new pandoc, new style
#+begin_src sh :results output
pandoc --version
#+end_src

#+RESULTS:
: pandoc 3.0.1
: Features: +server +lua
: Scripting engine: Lua 5.4
: User data directory: /home/teodorlu/.local/share/pandoc
: Copyright (C) 2006-2023 John MacFarlane. Web:  https://pandoc.org
: This is free software; see the source for copying conditions. There is no
: warranty, not even for merchantability or fitness for a particular purpose.

Today is the first time I'm writing (again) after getting Pandoc 3.
And I'm really appreciating the changes!
It's cleaner, and takes up less space.
